// questions08.js
quizDataRaw = [
    {
        "text": "フォレンジックとは、「     」を保護し、データの厳密な保管引渡し管理を維持しながら、科学的手法を適用して、データの識別、収集、検査及び分析を実施すること。",
        "choices": ["証拠の完全性", "情報の完全性", "証拠の機密性", "情報の機密性"],
        "correctIndex": 1
    },
    {
        "text": "フォレンジックとは、情報の完全性を保護し、データの厳密な保管引渡し管理を維持しながら、科学的手法を適用して、データの「     」及び分析を実施すること。",
        "choices": ["調査、分析、報告", "収集、検査、解析", "収集、検査、分析", "識別、収集、検査", "回収、検査、分析"],
        "correctIndex": 3
    },
    {
        "text": "フォレンジックの対象となる機器ではないのはどれか",
        "choices": ["サーバ", "クライアントＰＣ", "ネットーワーク機器", "携帯電話・スマートフォン", "マウス"],
        "correctIndex": 4
    },
    {
        "text": "◎フォレンジックの実施手順として適切なものを選びなさい。",
        "choices": ["収集・検査・解析・報告", "収集・調査・分析・報告", "収集・検査・分析・報告", "回収・検査・分析・報告"],
        "correctIndex": 2
    },
    {
        "text": "◎フォレンジックの実施手順として適切なものを選びなさい。",
        "choices": ["収集・検査・分析・報告", "収集・分析・検査・報告", "収集・報告・分析・検査", "報告・収集・分析・検査", "収集・分析・報告・検査"],
        "correctIndex": 0
    },
    {
        "text": "◎フォレンジックのプロセス「収集」の中で基本となるものはどれか選びなさい。",
        "choices": ["電磁的記録の保全", "電磁的証拠の保全", "電子的記録の保全", "電子的証拠の保全"],
        "correctIndex": 1
    },
    {
        "text": "◎「電磁的証拠の保全」について最も重要なことは、確実に「     」で、収集・取得し保全しておくこと。",
        "choices": ["速やか", "As-Is", "To-Be", "リアルタイム", "ベストエフォート", "オンデマンド"],
        "correctIndex": 1
    },
    {
        "text": "収集の手続きに不備があり、証拠の「     」に疑義が生じると、分析結果の信用性を失う。",
        "choices": ["原本同一性", "原本一致性", "証拠同一性", "証拠一致性"],
        "correctIndex": 0
    }
];